# CannotDrawExtrusionRoof Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..CannotDrawExtrusionRoof Property
BuiltInFailures..::..SketchFailures Class See Also
---
Can't make extruded roof.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotDrawExtrusionRoof { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotDrawExtrusionRoof As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotDrawExtrusionRoof {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace